{
    "Addendum 1 RFP JA-207652 Student and Staff Computing Devices.pdf": {
        "Bid_Number": "JA-207652",
        "Title": "Student and Staff Computing Devices",
        "Due_Date": "Not Specified",
        "Bid_Submission_Type": "Electronic or Manual (PDF) submission.",
        "Term_of_Bid": "Not Specified",
        "Pre_Bid_Meeting": "Not Specified",
        "Installation": "All deliveries and deployments must incorporate white glove services, which include asset decaling, asset reporting, etching, and delivery to varied locations. For Windows devices, autopilot is required. For Chromebooks, enrollment in Google Management is required.",
        "Bid_Bond_Requirement": "Not Specified",
        "Delivery_Date": "Dallas ISD is anticipating requesting quotes for different projects from awarded vendors starting in September of 2024.",
        "Payment_Terms": "Not Specified",
        "Any_Additional_Documentation_Required": [
            "Form 1295 - Certificate of Interested Parties",
            "Additional warranty information and pricing can be submitted as an attachment.",
            "Additional pricing for different tiers of devices can be submitted as an attachment.",
            "A signed copy of this Addendum."
        ],
        "MFG_for_Registration": "Not Specified",
        "Contract_or_Cooperative_to_use": "Not Specified",
        "Model_no": "To be proposed by vendor.",
        "Part_no": "To be proposed by vendor.",
        "Product": "Student and Staff Computing Devices, including laptops, Chromebooks, AIO computers, tablets, and stand-alone monitors.",
        "contact_info": "Not Specified",
        "company_name": "Dallas ISD",
        "Bid_Summary": "This is an addendum for RFP JA-207652 concerning student and staff computing devices for Dallas ISD. The purpose is to provide responses to vendor questions. Key points include a minimum requirement of USB 3.1 for monitors, etching for laptops only, specific OEM warranty requirements (1-year for Chromebooks, 3-years for Windows laptops), and software requirements like Autopilot for Windows and Google Management for Chromebooks. The award is anticipated for the August board meeting, with deliveries beginning in September 2024.",
        "Product_Specification": [
            "Display monitor: USB 3.1 is a minimum requirement; higher specifications like 3.2 are permissible.",
            "Etching: Required on Laptops only. Not required on stand-alone monitors or AIO computers.",
            "Asset Services: Both etching and asset tagging are required for devices.",
            "Warranty: Minimum one-year for student Chromebooks and three years for student and staff Windows laptops. All warranties must be from the OEM. Accidental Damage Protection is not required.",
            "AIO Desktops: Must include a webcam.",
            "Software Configuration: Windows devices require autopilot. Chromebooks require enrollment in Google Management.",
            "Laptop Chargers: A 65w charger is the minimum requirement for Chrome devices.",
            "Desktops: No requirement to be secured under or on a surface."
        ]
    },
    "Student and Staff Computing Devices __SOURCING #168884__ - Bid Information - {3} _ BidNet Direct.html": {
        "Bid_Number": "JA-207652",
        "Title": "Student and Staff Computing Devices SOURCING #168884",
        "Due_Date": "07/09/2024 03:00 PM EDT",
        "Bid_Submission_Type": "RFP - Request for Proposal (Informal)",
        "Term_of_Bid": "Five years",
        "Pre_Bid_Meeting": "06/10/2024 03:00 PM EDT",
        "Installation": "Required. All deliveries and deployments must incorporate white glove services, which include asset decaling, asset reporting, etching, and delivery to varied locations. For Windows devices, autopilot is required. For Chromebooks, enrollment in Google Management is required.",
        "Bid_Bond_Requirement": "Not Specified",
        "Delivery_Date": "Dallas ISD is anticipating requesting quotes for different projects from awarded vendors starting in September of 2024. Awarded vendors will need to coordinate a schedule of deliveries with the Dallas ISD ED TECH department.",
        "Payment_Terms": "Dallas ISD will primarily be using bond-funded money to purchase devices.",
        "Any_Additional_Documentation_Required": [
            "Form 1295 - Certificate of Interested Parties",
            "Signed copy of Addendum No. 1"
        ],
        "MFG_for_Registration": "Not Specified",
        "Contract_or_Cooperative_to_use": "Not Specified",
        "Model_no": "Not Specified",
        "Part_no": "Not Specified",
        "Product": "Student and staff computing devices, including laptops, desktops, tablet devices, display monitors, and a variety of device accessories (sleeves, cases, mice, keyboards, cables).",
        "contact_info": "Procurement Services, Phone: 972-925-3700, Email: ProcurementCS@dallasisd.org",
        "company_name": "Dallas Independent School District",
        "Bid_Summary": "This Request for Proposal (RFP) from the Dallas Independent School District is for the procurement of student and staff computing devices, including laptops, desktops, tablet devices, and display monitors. The resulting contracts are expected to be for a term of five years. The RFP specifies minimum hardware requirements and includes services such as white-glove deployment, asset tagging, and etching. Vendors can propose solutions for one or multiple categories, and the district may award contracts to single or multiple vendors per category.",
        "Product_Specification": [
            "Devices include laptops, desktops, tablet devices, and display monitors.",
            "Display monitors must have a USB 3.1 port as a minimum requirement.",
            "AIO Desktops require a webcam.",
            "Laptop chargers for Chrome devices require a minimum of 65w.",
            "A minimum one-year OEM warranty is required for student Chromebooks.",
            "A minimum three-year OEM warranty is required for student and staff Windows laptops.",
            "Accidental Damage Protection is not required.",
            "White glove services are required, including asset decaling, asset reporting, etching (on Laptops only), and delivery.",
            "For Windows devices, Autopilot is required.",
            "For Chromebooks, enrollment in Google Management is required."
        ]
    }
}